# 上个月浏览网站的用户和这个月浏览网站的用户就这去重
a = [112,42,41,34,31,31,23,23,23,23,12,12,12,12,3,3]
b = set(a)
print(b)
print(list(b))

"""
In [1]: a = "abcdef"

In [2]: b = set(a)

In [3]: b
Out[3]: {'a', 'b', 'c', 'd', 'e', 'f'}

In [4]: A = "bdf"

In [5]: B = set(A)

In [6]: B
Out[6]: {'b', 'd', 'f'}

In [7]: b&B	#交集，两个月浏览网站的老用户
Out[7]: {'b', 'd', 'f'}

In [8]: A = "bdfhuy"

In [9]: B = set(A)

In [10]: B
Out[10]: {'b', 'd', 'f', 'h', 'u', 'y'}

In [11]: b&B
Out[11]: {'b', 'd', 'f'}

In [12]: b|B	#并集，两个月的全部用户
Out[12]: {'a', 'b', 'c', 'd', 'e', 'f', 'h', 'u', 'y'}

In [13]: b-B	#差集，这是上个月的用户，这个月没来
Out[13]: {'a', 'c', 'e'}

In [14]: b^B	#对称差集，去除老用户的两个月的用户，就是这两个月的新用户
Out[14]: {'a', 'c', 'e', 'h', 'u', 'y'}
"""
